<?php

$data = [
    ["順位", "選手名", "チーム名", "防御率"],
    [1, "山本", "ドジャース", 1.80],
    [2, "ルサルド", "フィリーズ", 2.11],
    [3, "ペラルタ", "ブリュワーズ", 2.18],
    [4, "キング", "パドレス", 2.22],
    [5, "キャニング", "メッツ", 2.357]
];

#foreach文を使って選手の名前を表示させたい

// サンリオのキャラクターで二次元配列を作成してください
$sanrio_characters = [
    [
        "name" => "ハローキティ",

        "debut_year" => 1974,
        "description" => "白い子猫の女の子"
    ],
    [
        "name" => "マイメロディ",
        "debut_year" => 1975,
        "description" => "うさぎの女の子、赤い（またはピンクの）頭巾がトレードマーク"
    ],
    [
        "name" => "シナモロール",
        "debut_year" => 2001,
        "description" => "遠いお空の雲の上で生まれた、白いこいぬの男の子"
    ],
];

// サンリオキャラクターの名前とデビュー年を表示させる
foreach ($sanrio_characters as $character) {
    foreach ($character as $key => $value) {
        echo $value . "<br>";
    }
}
